cfe llm/Catalogs/AI_MCPСерверы.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_MCPСерверы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Endpoint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ТипАвторизацииMCP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаголовкаАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутСекунд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерОтветаБайт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНезащищенныйHTTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяСинхронизация</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_MCPКлиент/Ext/Module.bsl
Функция ПроверитьПодключение(Знач Сервер) Экспорт

	Сессия = Неопределено;
	Попытка
		Сессия = Инициализировать(Сервер);
		Результат = Новый Структура(
			"ok,protocolVersion,serverInfo,capabilities",
			Истина,
			Сессия.ВерсияПротокола,
			Сессия.ИнформацияСервера,
			Сессия.Возможности);
		Завершить(Сессия);
		Возврат Результат;
	Исключение
		Если Сессия <> Неопределено Тогда
			Завершить(Сессия);
		КонецЕсли;
		Возврат Новый Структура(
			"ok,error",
			Ложь,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецФункции

Функция ПолучитьИнструменты(Знач Сервер) Экспорт

	Сессия = Неопределено;
	Попытка
		Сессия = Инициализировать(Сервер);
		Если ПолучитьСвойство(Сессия.Возможности, "tools", Неопределено) = Неопределено Тогда
			ВызватьИсключение "MCP-сервер не объявил возможность tools.";
		КонецЕсли;

		Инструменты = Новый Массив;
		Курсор = "";
		Пока Истина Цикл
			Параметры = Новый Структура;
			Если ЗначениеЗаполнено(Курсор) Тогда
				Параметры.Вставить("cursor", Курсор);
			КонецЕсли;
			РезультатСтраницы = ВыполнитьМетод(Сессия, "tools/list", Параметры);
			Для Каждого Инструмент Из ПолучитьСвойство(
					РезультатСтраницы,
					"tools",
					Новый Массив) Цикл
				Инструменты.Добавить(Инструмент);
			КонецЦикла;
			Курсор = ПолучитьСвойство(РезультатСтраницы, "nextCursor", "");
			Если Не ЗначениеЗаполнено(Курсор) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Завершить(Сессия);
		Возврат Инструменты;
	Исключение
		Если Сессия <> Неопределено Тогда
			Завершить(Сессия);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

Функция ВыполнитьИнструмент(
		Знач Сервер,
		Знач ИмяИнструмента,
		Знач Аргументы,
		Знач ОбщийТаймаутСекунд = 0) Экспорт

	Сессия = Неопределено;
	Попытка
		Сессия = Инициализировать(Сервер, ОбщийТаймаутСекунд);
		Параметры = Новый Структура;
		Параметры.Вставить("name", ИмяИнструмента);
		Параметры.Вставить("arguments", Аргументы);
		Результат = ВыполнитьМетод(Сессия, "tools/call", Параметры);
		Завершить(Сессия);
		Возврат Результат;
	Исключение
		Если Сессия <> Неопределено Тогда
			Завершить(Сессия);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

Функция Инициализировать(Знач Сервер, Знач ОбщийТаймаутСекунд = 0)

	Настройки = ПолучитьНастройкиСервера(Сервер);
	Сессия = Новый Структура;
	Сессия.Вставить("Сервер", Сервер);
	Сессия.Вставить("Настройки", Настройки);
	Сессия.Вставить("Идентификатор", "");
	Сессия.Вставить("ВерсияПротокола", "2025-11-25");
	Сессия.Вставить("СледующийID", 1);
	Сессия.Вставить("ИнформацияСервера", Новый Структура);
	Сессия.Вставить("Возможности", Новый Структура);
	Сессия.Вставить(
		"КрайнийСрокМиллисекунды",
		?(ОбщийТаймаутСекунд > 0,
			ТекущаяУниверсальнаяДатаВМиллисекундах() + ОбщийТаймаутСекунд * 1000,
			0));

	ИнформацияКлиента = Новый Структура;
	ИнформацияКлиента.Вставить("name", "1c-llm-subsystem");
	ИнформацияКлиента.Вставить("version", "1.0.0");
	Параметры = Новый Структура;
	Параметры.Вставить("protocolVersion", Сессия.ВерсияПротокола);
	Параметры.Вставить("capabilities", Новый Структура);
	Параметры.Вставить("clientInfo", ИнформацияКлиента);
	Сообщение = СообщениеJSONRPC("initialize", Параметры, Сессия.СледующийID);
	Сессия.СледующийID = Сессия.СледующийID + 1;

	ОбновитьТаймаутСессии(Сессия);
	Ответ = AI_MCPТранспортHTTP.ВыполнитьJSONRPC(Настройки, Сообщение);
	Результат = ПолучитьРезультатJSONRPC(Ответ.JSON);
	Сессия.Идентификатор = Ответ.ИдентификаторСессии;
	Сессия.ВерсияПротокола = ПолучитьСвойство(
		Результат,
		"protocolVersion",
		Сессия.ВерсияПротокола);
	Если Не ПоддерживаетсяВерсияПротокола(Сессия.ВерсияПротокола) Тогда
		ВызватьИсключение "MCP-сервер согласовал неподдерживаемую версию протокола: "
			+ Строка(Сессия.ВерсияПротокола);
	КонецЕсли;
	Сессия.ИнформацияСервера = ПолучитьСвойство(
		Результат,
		"serverInfo",
		Новый Структура);
	Сессия.Возможности = ПолучитьСвойство(
		Результат,
		"capabilities",
		Новый Структура);

	Уведомление = СообщениеJSONRPC("notifications/initialized", Новый Структура);
	ОбновитьТаймаутСессии(Сессия);
	AI_MCPТранспортHTTP.ВыполнитьJSONRPC(Настройки, Уведомление, Сессия);
	Возврат Сессия;

КонецФункции

Функция ВыполнитьМетод(Знач Сессия, Знач Метод, Знач Параметры)

	ID = Сессия.СледующийID;
	Сессия.СледующийID = Сессия.СледующийID + 1;
	Сообщение = СообщениеJSONRPC(Метод, Параметры, ID);
	ОбновитьТаймаутСессии(Сессия);
	Ответ = AI_MCPТранспортHTTP.ВыполнитьJSONRPC(
		Сессия.Настройки,
		Сообщение,
		Сессия);
	Возврат ПолучитьРезультатJSONRPC(Ответ.JSON);

КонецФункции

Функция ПоддерживаетсяВерсияПротокола(Знач Версия)

	Возврат Версия = "2025-11-25"
		Или Версия = "2025-06-18"
		Или Версия = "2025-03-26";

КонецФункции

Процедура ОбновитьТаймаутСессии(Знач Сессия)

	КрайнийСрок = ПолучитьСвойство(Сессия, "КрайнийСрокМиллисекунды", 0);
	Если КрайнийСрок <= 0 Тогда
		Сессия.Настройки.ТаймаутСекунд = Сессия.Настройки.БазовыйТаймаутСекунд;
		Возврат;
	КонецЕсли;
	ОсталосьМиллисекунд = КрайнийСрок - ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если ОсталосьМиллисекунд <= 0 Тогда
		ВызватьИсключение "Истек общий таймаут выполнения MCP-инструмента.";
	КонецЕсли;
	ОсталосьСекунд = Макс(1, Цел(ОсталосьМиллисекунд / 1000));
	Сессия.Настройки.ТаймаутСекунд = Мин(
		Сессия.Настройки.БазовыйТаймаутСекунд,
		ОсталосьСекунд);

КонецПроцедуры

Процедура Завершить(Знач Сессия)

	AI_MCPТранспортHTTP.ЗавершитьСессию(Сессия.Настройки, Сессия);

КонецПроцедуры

Функция СообщениеJSONRPC(Знач Метод, Знач Параметры, Знач ID = Неопределено)

	Сообщение = Новый Структура;
	Сообщение.Вставить("jsonrpc", "2.0");
	Если ID <> Неопределено Тогда
		Сообщение.Вставить("id", ID);
	КонецЕсли;
	Сообщение.Вставить("method", Метод);
	Сообщение.Вставить("params", Параметры);
	Возврат Сообщение;

КонецФункции

Функция ПолучитьРезультатJSONRPC(Знач JSON)

	Если JSON = Неопределено Тогда
		ВызватьИсключение "MCP-сервер вернул пустой JSON-RPC ответ.";
	КонецЕсли;
	Ошибка = ПолучитьСвойство(JSON, "error", Неопределено);
	Если Ошибка <> Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			"Ошибка MCP JSON-RPC %1: %2",
			ПолучитьСвойство(Ошибка, "code", ""),
			ПолучитьСвойство(Ошибка, "message", "Неизвестная ошибка"));
	КонецЕсли;
	Результат = ПолучитьСвойство(JSON, "result", Неопределено);
	Если Результат = Неопределено Тогда
		ВызватьИсключение "MCP JSON-RPC ответ не содержит result.";
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ПолучитьНастройкиСервера(Знач Сервер)

	Если Не ЗначениеЗаполнено(Сервер) Тогда
		ВызватьИсключение "Не указан MCP-сервер.";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| AI_MCPСерверы.Активен КАК Активен,
		| AI_MCPСерверы.Endpoint КАК Endpoint,
		| AI_MCPСерверы.ТипАвторизации КАК ТипАвторизации,
		| AI_MCPСерверы.ИмяЗаголовкаАвторизации КАК ИмяЗаголовкаАвторизации,
		| AI_MCPСерверы.ТаймаутСекунд КАК ТаймаутСекунд,
		| AI_MCPСерверы.МаксимальныйРазмерОтветаБайт КАК МаксимальныйРазмерОтветаБайт,
		| AI_MCPСерверы.РазрешитьНезащищенныйHTTP КАК РазрешитьНезащищенныйHTTP
		|ИЗ
		| Справочник.AI_MCPСерверы КАК AI_MCPСерверы
		|ГДЕ
		| AI_MCPСерверы.Ссылка = &Сервер";
	Запрос.УстановитьПараметр("Сервер", Сервер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "MCP-сервер не найден.";
	КонецЕсли;
	Если Не Выборка.Активен Тогда
		ВызватьИсключение "MCP-сервер отключен.";
	КонецЕсли;
	Настройки = Новый Структура;
	Настройки.Вставить("Endpoint", Выборка.Endpoint);
	Настройки.Вставить("ТипАвторизации", Выборка.ТипАвторизации);
	Настройки.Вставить("ИмяЗаголовкаАвторизации", Выборка.ИмяЗаголовкаАвторизации);
	Настройки.Вставить("ТаймаутСекунд", ?(Выборка.ТаймаутСекунд > 0, Выборка.ТаймаутСекунд, 60));
	Настройки.Вставить("БазовыйТаймаутСекунд", Настройки.ТаймаутСекунд);
	Настройки.Вставить(
		"МаксимальныйРазмерОтветаБайт",
		?(Выборка.МаксимальныйРазмерОтветаБайт > 0, Выборка.МаксимальныйРазмерОтветаБайт, 5242880));
	Настройки.Вставить("РазрешитьНезащищенныйHTTP", Выборка.РазрешитьНезащищенныйHTTP);
	Настройки.Вставить("Секрет", AI_MCPСекреты.Получить(Сервер));
	Возврат Настройки;

КонецФункции

Функция ПолучитьСвойство(Знач Источник, Знач Имя, Знач ПоУмолчанию)

	Если Источник = Неопределено Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Значение = Неопределено;
	Попытка
		Если Источник.Свойство(Имя, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Попытка
		Значение = Источник.Получить(Имя);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат ПоУмолчанию;

КонецФункции
